r0tary/Floor-Heating-IO-Module/IO_MODULE_proj_Zigbee_FreeRTOS/STM32CubeIDE/Application/User/STM32_WPAN/App/app_zigbee.c
static osThreadId_t     OsTaskPushButtonId;
const osThreadAttr_t TaskPushButton_attributes =

{
    .name = CFG_TASK_PUSH_BUTTON_PROCESS_NAME,
    .attr_bits = CFG_TASK_PROCESS_ATTR_BITS,
    .cb_mem = CFG_TASK_PROCESS_CB_MEM,
    .cb_size = CFG_TASK_PROCESS_CB_SIZE,
    .stack_mem = CFG_TASK_PROCESS_STACK_MEM,
    //.priority = osPriorityNormal,
    .priority = osPriorityAboveNormal4,
    .stack_size = CFG_TASK_PROCESS_STACK_SIZE
};


/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/


/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Initialize the mutex */
  MtxZigbeeId = osMutexNew( NULL );

  /* Initialize the semaphores */
  StartupEndSemaphore = osSemaphoreNew( 1, 0, NULL ); /*< Create the semaphore and make it busy at initialization */
  TransferToM0Semaphore = osSemaphoreNew( 1, 0, NULL );


  /* Register task */
  /* Create the different tasks */
  OsTaskNotifyM0ToM4Id = osThreadNew(APP_ZIGBEE_ProcessNotifyM0ToM4, NULL,&TaskNotifyM0ToM4_attr);
  OsTaskRequestM0ToM4Id = osThreadNew(APP_ZIGBEE_ProcessRequestM0ToM4, NULL,&TaskRequestM0ToM4_attr);

  /* Task associated with network creation process */
  OsTaskNwkFormId = osThreadNew(APP_ZIGBEE_ProcessNwkForm, NULL,&TaskNwkForm_attr);

  /* USER CODE BEGIN APP_ZIGBEE_INIT */

  /*ADD ON*/

   /* Task associated with getting thermostat short network address */
  OsTaskGetThermAddr = osThreadNew(APP_ZIGBEE_ProcessGetThermAddr, NULL,&TaskGetThermAddr_attr);

   /* Task associated with getting zigbee temperature data */
  //OsTaskGetThermTemp = osThreadNew(APP_ZIGBEE_ProcessGetThermTemp, NULL,&TaskGetThermTemp_attr);
   /*ADD ON*/


   /* Task associated with push button SW1 */
   //OsTaskPushButtonId = osThreadNew(APP_ZIGBEE_ProcessPushButton, NULL, &TaskPushButton_attributes);

  /* USER CODE END APP_ZIGBEE_INIT */

  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();

  /*set flag*/



}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_StackLayersInit(void)
{
  //vTaskSuspend(ModbusH.myTaskModbusAHandle);
  APP_DBG("APP_ZIGBEE_StackLayersInit");


  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
  BSP_LED_Off(LED_RED);
  BSP_LED_Off(LED_GREEN);
  BSP_LED_Off(LED_BLUE);
  /* USER CODE END APP_ZIGBEE_StackLayersInit */

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeForm;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;
  zigbee_app_info.thermExtAddr  = 0x003c84fffe02386a;
  zigbee_app_info.thermShortAddr = 0x0000U;
  zigbee_app_info.ThermAddrFound = 0;
  zigbee_app_info.epCount = 0;
  zigbee_app_info.bindingFinished =0;
  zigbee_app_info.reportConfigFinished = 0;
  zigbee_app_info.reportReadFinished = 0;
  zigbee_app_info.currentTemp = 273;
  zigbee_app_info.minTemp = 0;
  zigbee_app_info.maxTemp = 0;
  zigbee_app_info.setpointTemp = 0;

  /* run the task */
  osThreadFlagsSet(OsTaskNwkFormId,1);
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* USER CODE BEGIN CONFIG_ENDPOINT */

  /* Endpoint: ICON_ENDPOINT */
	req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
	req.deviceId = ZCL_DEVICE_THERMOSTAT;
	req.endpoint = ICON_ENDPOINT;
	ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
	assert(conf.status == ZB_STATUS_SUCCESS);

  /* Thermostat client */
	zigbee_app_info.device_therm_client = ZbZclThermClientAlloc (zigbee_app_info.zb, ICON_ENDPOINT);
	assert(zigbee_app_info.device_therm_client != NULL);
	ZbZclClusterEndpointRegister(zigbee_app_info.device_therm_client);
  /* USER CODE END CONFIG_ENDPOINT */
}

/**
 * @brief  Handle Zigbee network forming and joining task for FreeRTOS
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessNwkForm(void *argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    APP_ZIGBEE_NwkForm();
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkForm(void)
{

  if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
  {
    struct ZbStartupT config;
    enum ZbStatusCodeT status;

    /* Configure Zigbee Logging */
    ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_ALL, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    /* Set the centralized network */
    APP_DBG("Network config : APP_STARTUP_CENTRALIZED_COORDINATOR");
    config.startupControl = zigbee_app_info.startupControl;

    /* Using the default HA preconfigured Link Key */
    memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);

    config.channelList.count = 1;
    config.channelList.list[0].page = 0;
    config.channelList.list[0].channelMask = 1 << CHANNEL; /*Channel in use */

    /* Using ZbStartupWait (blocking) */
    status = ZbStartupWait(zigbee_app_info.zb, &config);

    APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
    zigbee_app_info.join_status = status;

    if (status == ZB_STATUS_SUCCESS)
    {
      zigbee_app_info.join_delay = 0U;
      zigbee_app_info.init_after_join = true;
      APP_DBG("Startup done !\n");
      /* USER CODE BEGIN 3 */
       BSP_LED_On(LED_BLUE);
       zigbee_app_info.extaddr = ZbExtendedAddress(zigbee_app_info.zb);
       zigbee_app_info.nwkAddr = ZbShortAddress(zigbee_app_info.zb);
       zigbee_app_info.statusgetendpoint = ZB_STATUS_ALLOC_FAIL;
       APP_DBG("Network created ");
      /* USER CODE END 3 */
    }
    else
    {
      APP_DBG("Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
      zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
      /* USER CODE BEGIN 4 */

      /* USER CODE END 4 */
    }
  }

  /* If Network forming/joining was not successful reschedule the current task to retry the process */
  if (zigbee_app_info.join_status != ZB_STATUS_SUCCESS)
  {
    osThreadFlagsSet(OsTaskNwkFormId,1);
  }
  /* USER CODE BEGIN NW_FORM */
  else
  {
    zigbee_app_info.init_after_join = false;

    /* Assign ourselves to the group addresses */
    APP_ZIGBEE_ConfigGroupAddr();

    /* Since we're using group addressing (broadcast), shorten the broadcast timeout */
    uint32_t bcast_timeout = 3;
    ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &bcast_timeout, sizeof(bcast_timeout));

    //run the task to get short address of thermostat
    osThreadFlagsSet(OsTaskGetThermAddr,1);
    //APP_DBG ("run temp task")the ;
    //osThreadFlagsSet(OsTaskGetThermTemp,1);
    //APP_ZIGBEE_GetThermTemp();

