r0tary/Floor-Heating-IO-Module/IO_MODULE_proj_Zigbee_FreeRTOS/STM32CubeIDE/Application/User/STM32_WPAN/App/app_zigbee.c
  Receive_Notification_From_M0();
}

/**
 * @brief  This function is called before sending any ot command to the M0
 *         core. The purpose of this function is to be able to check if
 *         there are no notifications coming from the M0 core which are
 *         pending before sending a new ot command.
 * @param  None
 * @retval None
 */
void Pre_ZigbeeCmdProcessing(void)
{
  osMutexAcquire(MtxZigbeeId, osWaitForever);
}

/**
 * @brief  This function waits for getting an acknowledgment from the M0.
 *
 * @param  None
 * @retval None
 */
static void Wait_Getting_Ack_From_M0(void)
{
  osSemaphoreAcquire(TransferToM0Semaphore, osWaitForever);
  osMutexRelease(MtxZigbeeId);
}

/**
 * @brief  Receive an acknowledgment from the M0+ core.
 *         Each command send by the M4 to the M0 are acknowledged.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Ack_From_M0(void)
{
  osSemaphoreRelease(TransferToM0Semaphore);
}

/**
 * @brief  Receive a notification from the M0+ through the IPCC.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Notification_From_M0(void)
{
  CptReceiveNotifyFromM0++;
  osThreadFlagsSet(OsTaskNotifyM0ToM4Id,1);
}

/**
 * @brief  This function is called when a request from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_M0RequestReceived(TL_EvtPacket_t *Reqbuffer)
{
  p_ZIGBEE_request_M0_to_M4 = Reqbuffer;

  CptReceiveRequestFromM0++;
  osThreadFlagsSet(OsTaskRequestM0ToM4Id,1);
}

/**
 * @brief Perform initialization of TL for Zigbee.
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_TL_INIT(void)
{
  ZigbeeConfigBuffer.p_ZigbeeOtCmdRspBuffer = (uint8_t *)&ZigbeeOtCmdBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotAckBuffer = (uint8_t *)ZigbeeNotifRspEvtBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotifRequestBuffer = (uint8_t *)ZigbeeNotifRequestBuffer;
  TL_ZIGBEE_Init(&ZigbeeConfigBuffer);
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    if (CptReceiveNotifyFromM0 != 0)
    {
      /* If CptReceiveNotifyFromM0 is > 1. it means that we did not serve all the events from the radio */
      if (CptReceiveNotifyFromM0 > 1U)
      {
        APP_ZIGBEE_Error(ERR_REC_MULTI_MSG_FROM_M0, 0);
      }
      else
      {
        Zigbee_CallBackProcessing();
      }
      /* Reset counter */
      CptReceiveNotifyFromM0 = 0;
    }
  }
}

/**
 * @brief Process the requests coming from the M0.
 * @param
 * @return
 */
static void APP_ZIGBEE_ProcessRequestM0ToM4(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    if (CptReceiveRequestFromM0 != 0)
    {
      Zigbee_M0RequestProcessing();
      CptReceiveRequestFromM0 = 0;
    }
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */


void APP_ZIGBEE_LaunchPushButtonTask(void)
{
  osThreadFlagsSet(OsTaskPushButtonId,1);
}

static void APP_ZIGBEE_ProcessPushButton(void *argument)
{
  for(;;)
  {
	APP_ZIGBEE_GetThermAddr();
	APP_ZIGBEE_GetThermTemp();
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
  }
}

/**
 * @brief  Set group addressing mode
 * @param  None
 * @retval None
 */

static void APP_ZIGBEE_ConfigGroupAddr(void)
{
  struct ZbApsmeAddGroupReqT req;
  struct ZbApsmeAddGroupConfT conf;

  memset(&req, 0, sizeof(req));
  req.endpt = SW1_ENDPOINT;
  req.groupAddr = SW1_GROUP_ADDR;
  ZbApsmeAddGroupReq(zigbee_app_info.zb, &req, &conf);

}


/**
 * @brief  Handle Zigbee get thermostat network short address for FreeRTOS
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessGetThermAddr(void *argument)
{
  UNUSED(argument);
  for(;;)
  {
	//flag = osEventFlagsWait(nwk_event_id, FLAG_NWK, osFlagsWaitAll, osWaitForever);
	osThreadFlagsWait(1,osFlagsWaitAny,osWaitForever);
    APP_ZIGBEE_GetThermAddr();
    //if (zigbee_app_info.thermShortAddr !=0)
    //{
	//	osEventFlagsSet(asoc_event_id, FLAG_ASOC);
    //}
  }
}


/*find the short address of the thermostat */
void APP_ZIGBEE_GetThermAddr(void)
{
	struct ZbZdoNwkAddrReqT shortrequest;
	shortrequest.extAddr = zigbee_app_info.thermExtAddr;//0x003c84fffe02386a;
	shortrequest.dstNwkAddr = 0xfffd;
	shortrequest.reqType = ZB_ZDO_ADDR_REQ_TYPE_SINGLE;
	shortrequest.startIndex = 0;
	if (ZbZdoNwkAddrReq(zigbee_app_info.zb, &shortrequest, &GetThermAddr_cb, NULL)== ZB_STATUS_SUCCESS)
	{
		APP_DBG("Thermostat short address requested");
	}

}

/*find the short address of the thermostat CALLBACK*/
static void GetThermAddr_cb(struct ZbZdoNwkAddrRspT  *rsp, void *cb_arg)
	{
		if (rsp->status == ZB_STATUS_SUCCESS)
		{
			APP_DBG("%s : Shortrequest_cb Callback success status = 0x%02x", __func__, rsp->status);
			zigbee_app_info.thermShortAddr = rsp->nwkAddr;
			zigbee_app_info.thermEP = ICON_ENDPOINT;
		    APP_DBG("zigbee_app_info.thermextaddr extAddr = 0x%04x",  zigbee_app_info.thermExtAddr);
			APP_DBG("zigbee_app_info.thermshortaddr nwkAddr = 0x%02x",  zigbee_app_info.thermShortAddr);
			APP_DBG("zigbee_app_info.thermep EP = 0x%02x",  zigbee_app_info.thermEP);
			zigbee_app_info.ThermAddrFound = 1;

			//osThreadFlagsSet(OsTaskGetThermTemp,1);
			//if thermostat has not joined the network yet, run the short address task again
			if (zigbee_app_info.thermShortAddr == 0x000U)
				{
					osThreadFlagsSet(OsTaskGetThermAddr,1);
				}

			//if thermostat has joined the network yet, release the  modbus task
			if (zigbee_app_info.thermShortAddr != 0x000U)
			{
				//osThreadFlagsSet(OsTaskGetThermTemp,1);
				osThreadFlagsSet(ModbusStartHandle,1);
			}
		}
		//if network has not been formed yet (callback function fails), run the short address task again
		else
		{
			APP_DBG("Short request  Callback fail");
			osThreadFlagsSet(OsTaskGetThermAddr,1);
		}

	}

/**
 * @brief  Handle Zigbee get thermostat temp readings for FreeRTOS
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessGetThermTemp(void *argument)
{
  UNUSED(argument);

  for(;;)
  {
	APP_DBG ("enter temp task");
	osThreadFlagsWait(1,osFlagsWaitAny,osWaitForever);
    APP_ZIGBEE_GetThermTemp();
  }
}


void APP_ZIGBEE_GetThermTemp(void)
{
	ZbZclReadReqT readReq;
	memset(&readReq, 0, sizeof(readReq));
	readReq.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
	readReq.dst.endpoint = ICON_ENDPOINT;
	readReq.dst.nwkAddr = zigbee_app_info.thermShortAddr;//zigbee_app_info.nwkAddr;//0x0000
	readReq.count = 3U;
	readReq.attr[0]=ZCL_THERM_SVR_ATTR_LOCAL_TEMP ;
	readReq.attr[1]=ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT;
	readReq.attr[2]=ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT ;
	//readReq.attr[3]=ExternalMeasuredRoomSensor ;
	//readReq.attr[4]=SetpointChangeSource ;

