r0tary/Floor-Heating-IO-Module/IO_MODULE_proj_Zigbee_FreeRTOS/STM32CubeIDE/Application/User/STM32_WPAN/App/app_zigbee.c
	if(ZbZclReadReq(zigbee_app_info.device_therm_client, &readReq, &GetThermTemp_cb, zigbee_app_info.device_therm_client) != ZCL_STATUS_SUCCESS)
	{
	    APP_DBG("Error, ZbZclReadReq failed (ICON_ENDPOINT)");
	}

}

static void GetThermTemp_cb(const ZbZclReadRspT *readRsp, void *arg)
{
  int i;
  int16_t currentTemp;
  int16_t minTemp;
  int16_t maxTemp;
  //int16_t info1;
  //int16_t info2;

  for(i=0;i<readRsp->count;i++)
  {
    if(readRsp->attr[i].status == ZCL_STATUS_SUCCESS)
    {
      Zigbee_ready = 1;
      switch(readRsp->attr[i].attrId)
      {
      case ZCL_THERM_SVR_ATTR_LOCAL_TEMP:
        currentTemp = pletoh16(readRsp->attr[i].value);
        APP_DBG("[DEV TEMP]Current Temperature= %d,%dC",currentTemp/100, currentTemp%100);
        zigbee_app_info.currentTemp = pletoh16(readRsp->attr[i].value);
        ZigbeeCurrentTemp[0]= pletoh16(readRsp->attr[i].value);
        break;
      case ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT:
    	minTemp = pletoh16(readRsp->attr[i].value);
        APP_DBG("[DEV TEMP] Min set Temperature= %d,%dC",minTemp/100,minTemp%100);
        if (minTemp != zigbee_app_info.minTemp)
        {
        	zigbee_app_info.minTemp = pletoh16(readRsp->attr[i].value);
        	zigbee_app_info.setpointTemp = pletoh16(readRsp->attr[i].value);
        	ZigbeeSetpointTemp[0]= pletoh16(readRsp->attr[i].value);
        	APP_DBG("[DEV TEMP] New setpoint Temperature= %d,%dC",minTemp/100,minTemp%100);
        }
        break;
      case ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT:
    	maxTemp = pletoh16(readRsp->attr[i].value);
        APP_DBG("[DEV TEMP] Max set Temperature= %d,%dC",maxTemp/100,maxTemp%100);
        if (maxTemp != zigbee_app_info.maxTemp)
        {
        	zigbee_app_info.maxTemp = pletoh16(readRsp->attr[i].value);
        	zigbee_app_info.setpointTemp = pletoh16(readRsp->attr[i].value);
        	ZigbeeSetpointTemp[0]= pletoh16(readRsp->attr[i].value);
        	APP_DBG("[DEV TEMP] New setpoint Temperature= %d,%dC",maxTemp/100,maxTemp%100);
        }
        break;
      default:
        break;
      }
      RxCB_type = 1;
    }
    else
    {
    	//osThreadFlagsSet(OsTaskGetThermTemp,1);
    	APP_DBG("[DEV TEMP] Failed to read attribute %d",readRsp->attr[i].attrId);

    }
  }
}

//
/* Thread for reading Zigbee thermostat address data*/
void Zigbee_Therm_Addr_Start()
{
	OsTaskGetThermAddr = osThreadNew(APP_ZIGBEE_ProcessGetThermAddr, NULL,&TaskGetThermAddr_attr);
}

/* Thread for reading Zigbee temp data*/
//void Zigbee_Temp_Start()
//{
//	OsTaskGetThermTemp = osThreadNew(APP_ZIGBEE_ProcessGetThermTemp, NULL,&TaskGetThermTemp_attr);
//}
/* USER CODE END FD_LOCAL_FUNCTIONS */
